Atualizando arquivo ARCHITECTURE para usar Mermaid
